/* No comment provided by engineer. */
"AboutAppText" = "AboutAppText";

/* No comment provided by engineer. */
"AboutFooterText" = "AboutFooterText";

/* No comment provided by engineer. */
"AboutOrgText" = "AboutOrgText";

/* No comment provided by engineer. */
"AboutOrgTitle" = "AboutOrgTitle";

/* No comment provided by engineer. */
"Add to Existing Contact" = "Add to Existing Contact";

/* No comment provided by engineer. */
"Browse" = "Browse";

/* No comment provided by engineer. */
"Bus Stop" = "Bus Stop";

/* No comment provided by engineer. */
"Cancel" = "Cancel";

/* No comment provided by engineer. */
"Clear" = "Clear";

/* No comment provided by engineer. */
"Clear Recents" = "Clear Recents";

/* No comment provided by engineer. */
"Clear Recents?" = "Clear Recents?";

/* No comment provided by engineer. */
"Comment" = "Comment";

/* No comment provided by engineer. */
"Connection Failed" = "Connection Failed";

/* No comment provided by engineer. */
"Connection Timed Out" = "Connection Timed Out";

/* No comment provided by engineer. */
"Contact" = "Contact";

/* No comment provided by engineer. */
"Could not connect to server. Please try again later." = "Could not connect to server. Please try again later.";

/* No comment provided by engineer. */
"Create New Contact" = "Create New Contact";

/* No comment provided by engineer. */
"Credits" = "Credits";

/* No comment provided by engineer. */
"day ago" = "day ago";

/* No comment provided by engineer. */
"days ago" = "days ago";

/* No comment provided by engineer. */
"Default font" = "Default font";

/* No comment provided by engineer. */
"Default font size" = "Default font size";

/* No comment provided by engineer. */
"Details" = "Details";

/* No comment provided by engineer. */
"Email" = "Email";

/* No comment provided by engineer. */
"Email All Notes" = "Email All Notes";

/* No comment provided by engineer. */
"Error Connecting" = "Error Connecting";

/* No comment provided by engineer. */
"Event Detail" = "Event Detail";

/* No comment provided by engineer. */
"Event website" = "Event website";

/* No comment provided by engineer. */
"Events" = "Events";

/* No comment provided by engineer. */
"Exit this screen" = "Exit this screen";

/* No comment provided by engineer. */
"Facebook" = "Facebook";

/* No comment provided by engineer. */
"Failed to register your device for a push notification. Please try again later." = "Failed to register your device for a push notification. Please try again later.";

/* No comment provided by engineer. */
"foursquare" = "foursquare";

/* No comment provided by engineer. */
"Home" = "Home";

/* No comment provided by engineer. */
"hour ago" = "hour ago";

/* No comment provided by engineer. */
"hours ago" = "hours ago";

/* No comment provided by engineer. */
"Hybrid" = "Hybrid";

/* No comment provided by engineer. */
"Jump to a Date" = "Jump to a Date";

/* No comment provided by engineer. */
"Last Updated" = "Last Updated";

/* No comment provided by engineer. */
"Loading..." = "Loading...";

/* No comment provided by engineer. */
"Login failed" = "Login failed";

/* No comment provided by engineer. */
"Map" = "Map";

/* No comment provided by engineer. */
"Map Search Placeholder" = "Search Harvard Campus";

/* No comment provided by engineer. */
"Map Type" = "Map Type";

/* No comment provided by engineer. */
"minute ago" = "minute ago";

/* No comment provided by engineer. */
"minutes ago" = "minutes ago";

/* No comment provided by engineer. */
"Nearby" = "Nearby";

/* No comment provided by engineer. */
"New Note" = "New Note";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Organizer email" = "Organizer email";

/* No comment provided by engineer. */
"Organizer phone" = "Organizer phone";

/* No comment provided by engineer. */
"Other" = "Other";

/* No comment provided by engineer. */
"others attending" = "others attending";

/* No comment provided by engineer. */
"Password" = "Password";

/* No comment provided by engineer. */
"Photo" = "Photo";

/* No comment provided by engineer. */
"Please check your Internet connection and try again." = "Please check your Internet connection and try again.";

/* No comment provided by engineer. */
"Post to Twitter" = "Post to Twitter";

/* No comment provided by engineer. */
"Print All Notes" = "Print All Notes";

/* No comment provided by engineer. */
"Problem connecting to server. Please try again later." = "Problem connecting to server. Please try again later.";

/* No comment provided by engineer. */
"Recently Viewed" = "Recently Viewed";

/* No comment provided by engineer. */
"Request is not supported in this version of" = "Request is not supported in this version of";

/* No comment provided by engineer. */
"Reunion photos are posted etc etc etc." = "Reunion photos are posted etc etc etc.";

/* No comment provided by engineer. */
"Route" = "Route";

/* No comment provided by engineer. */
"Satellite" = "Satellite";

/* No comment provided by engineer. */
"Schedule" = "Schedule";

/* No comment provided by engineer. */
"Search" = "Search";

/* No comment provided by engineer. */
"Send Feedback" = "Send Feedback";

/* No comment provided by engineer. */
"Server is taking too long to respond. Please try again later." = "Server is taking too long to respond. Please try again later.";

/* No comment provided by engineer. */
"Sign In" = "Sign In";

/* No comment provided by engineer. */
"Sign In to Twitter" = "Sign In to Twitter";

/* No comment provided by engineer. */
"Sign into your Twitter account." = "Sign into your Twitter account.";

/* No comment provided by engineer. */
"Sign Out" = "Sign Out";

/* No comment provided by engineer. */
"Standard" = "Standard";

/* No comment provided by engineer. */
"Subscription failed" = "Subscription failed";

/* No comment provided by engineer. */
"There was a problem retrieving data. Please check your connection and try again." = "There was a problem retrieving data. Please check your connection and try again.";

/* No comment provided by engineer. */
"Third party services" = "Third party services";

/* No comment provided by engineer. */
"Tip: You can search above by a person's first or last name or email address." = "Tip: You can search above by a person's first or last name or email address.";

/* No comment provided by engineer. */
"Tweet" = "Tweet";

/* No comment provided by engineer. */
"Twitter" = "Twitter";

/* No comment provided by engineer. */
"Unable to connect to Twitter, please try again later." = "Unable to connect to Twitter, please try again later.";

/* No comment provided by engineer. */
"Unable to log in to Twitter, please check your credentials and try again." = "Unable to log in to Twitter, please check your credentials and try again.";

/* No comment provided by engineer. */
"Unable to perform this request. Please check your login credentials." = "Unable to perform this request. Please check your login credentials.";

/* No comment provided by engineer. */
"Unauthorized Request" = "Unauthorized Request";

/* No comment provided by engineer. */
"Unsupported Request" = "Unsupported Request";

/* No comment provided by engineer. */
"Updates to show on home screen" = "Updates to show on home screen";

/* No comment provided by engineer. */
"Upload" = "Upload";

/* No comment provided by engineer. */
"Username" = "Username";

/* No comment provided by engineer. */
"Work" = "Work";

